// MainApi. Отвечает за взаимодействие с написанным вами Node.js API.
// Конструктор этого класса принимает опции, необходимые для инициализации работы с API.
// Вот список обязательных методов:
// signup регистрирует нового пользователя;
// signin аутентифицирует пользователя на основе почты и пароля;
// getUserData возвращает информацию о пользователе;
// getArticles забирает все статьи;
// createArticle создаёт статью;
// removeArticle удаляет статью.
// Каждый из методов этих классов возвращает промис,
// содержит в себе обработку ответа и обязательный блок .catch(),
// бросающий ошибку дальше с помощью Promise.reject или throw.
// Также классы MainApi и NewsApi не должны взаимодействовать с DOM напрямую из своих методов.
export default class MainApi {
  constructor(options) {
    this.options = options;
  }
  // signup(){ //регистрирует нового пользователя;

  // }
  // signin (){//аутентифицирует пользователя на основе почты и пароля;

  // }
}
